package section7;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileReader;
import java.text.DecimalFormat;

public class main3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		String[] OneRec = { //배열을 선언한다.
				"사고유형대분류,사고유형중분류,사고유형,사고건수,사망자수,중상자수,경상자수,부상신고자수",
				"차대사람,횡단중,횡단중,13147,520,6417,6617,517",
				"차대사람,차도통행중,차도통행중,3702,195,1423,2022,209",
				"차대사람,길가장자리구역통행중,길가장자리구역통행중,2079,40,591,1371,160",
				"차대사람,보도통행중,보도통행중,2015,26,707,1260,129",
				"차대사람,기타,기타,15278,288,5195,9290,1272",
				"차대차,정면충돌,정면충돌,7494,181,3657,8468,677",
				"차대차,측면충돌,측면충돌,74742,441,19893,88838,6945",
				"차대차,후진중충돌,후진중충돌,3253,4,297,4003,154",
				"차대차,추돌,추돌,32993,370,7924,48345,3172",
				"차대차,기타,기타,46070,303,11000,50973,4764",
				"차량단독,전도,전도,1108,90,412,466,281",
				"차량단독,전복,전복,178,26,81,98,32",
				"차량단독,공작물충돌,공작물충돌,3233,340,1376,1745,668",
				"차량단독,주/정차차량 충돌,주/정차차량 충돌,19,4,8,8,1",
				"차량단독,도로이탈,도로이탈 추락,413,92,185,203,46",
				"차량단독,도로이탈,도로이탈 기타,199,30,113,113,24",
				"차량단독,기타,기타,3728,130,1285,2213,543",
				"철길건널목,철길건널목,철길건널목,3,1,0,3,0"
				};
		// 첫줄(구분) 부분을 콤마를 단위로 잘라서 문자열 배열에 넣는다.
		String[] field_name = OneRec[0].split(",");
		// 배열의 1번째 성분부터 마지막 성분까지 돌리는 반복문을 실행한다
		for (int i = 1; i < OneRec.length; i++) {
			// 가져온 성분을 콤마 단위로 잘라서 문자열 배열에 넣는다.
			String[] field = OneRec[i].split(",");
			System.out.println("********************************************");
			for (int j = 0; j < field_name.length; j++) {	// 앞서 만든 문자열 배열의 길이만큼 반복하는 for문을 작성한다.
				System.out.printf(" %s : %s\n", field_name[j], field[j]);	//첫번 문자열(구분)과 방금 가져온 문자열의 정보를 출력한다.
			}
			System.out.println("********************************************");
		}
		
	}

}
